Repository: undestroyer/qr-widget-swift
Catalog: Resources/Strings/*.lproj/Localizable.strings
Languages: ru

source: Scan QR
ru: Сканировать QR

source: Scanning not supported
ru: Сканирование не поддерживается

source: Your device does not support scanning a code from an item. Please use a device with a camera.
ru: Ваше устройство не поддерживает сканирование. Пожалуйста используйте устройство с камерой

source: About
ru: О приложении

source: This application allows you to add a QR code widget to your home screen (desktop).
ru: Это приложение позволяет вам добавить виджет QR кода на свой домашний экран (рабочий стол).

source: For everything to work as expected, you need to do the following:
ru: Чтобы все сработало как нужно, вам нужно сделать следующее:

source: 1) Scan QR by clicking on the "Scan QR" button on the main screen of the application
ru: 1) Отсканировать QR нажатием на кнопку "Сканировать QR" на главном экране приложения

source: 2) (optional) Allow access to the camera (without permission, the application will not be able to scan the code)
ru: 2) (опционально) Разрешить доступ к камере (без разрешения, приложение не сможет отсканировать код)

source: 3) Point the camera at your QR
ru: 3) Навести камеру на ваш QR.

source: 4) Once the app recognizes the QR, the app will return to the home screen and show your QR.
ru: 4) Как только приложение распознает QR, приложение вернется на главный экран и покажет ваш QR.

source: 5) Now it's time to add the widget to your home screen. Minimize the application and pinch the free space on the screen with your finger
ru: 5) Теперь пора добавить виджет на домашний экран. Сворачиваем приложение и зажимаем пальцем свободное место на экране.

source: 6) Click on the button with "+" in the upper right corner
ru: 6) Нажмите на кнопку с "+" в верхнем правом углу

source: 7) Find this application in the list, click on it and select the appropriate widget form.
ru: 7) Найдите это приложение в списке, нажмите на него и выберите подходящую форму виджета.

source: That's all, now you have it on your home screen. To replace QR - scan another QR in the application and the widget will immediately update.
ru: Это все, теперь у вас на рабочем экране. Чтобы заменить QR - отсканируйте другой QR в приложении и виджет сразу обновится.

source: The QR in the widget may look slightly different from the one you scanned. This is normal, no changes were made to your QR, it was just created with slightly different parameters.
ru: QR в виджете может визуально немного отличаться от того который вы сканировали. Это нормально, никаких изменений в ваш QR не вносилось, просто он создался с немного другими параметрами.

source: How the app works:
ru: Как работает приложение:

source: - You scan the QR in the app
ru: - Вы сканируете QR в приложении

source: - The app recognizes QR and receives data from the code
ru: - Приложение распознает QR и получает данные из кода

source: - The application creates a new QR with the specified data
ru: - Приложение создает новый QR c указанными данными

source: Questions and answers:
ru: Вопросы и ответы:

source: Question: Can the app work with multiple QR codes?
ru: Вопрос: Может ли приложение работать с несколькими QR кодами?

source: Answer: No, the current version of the app only supports 1 QR.
ru: Ответ: Нет, текущая версия приложения поддерживает только 1 QR.

source: Q: Can the app recognize QR from the gallery photo?
ru: В: Может приложение распознать QR с фотографии из галлереи?

source: A: No, the current version of the app only recognizes QR from the camera.
ru: О: Нет, текущая версия приложения распознает QR только с камеры.

source: Q: The app does not recognize QR. What to do?
ru: В: Приложение не распознает QR. Что делать?

source: A: There may be a lack of lighting or contrast. If you scan QR from another monitor, glare may be interfering.
ru: О: Возможно не хватает освещения или контрастности. Если вы сканируете QR с другого монитора - возможно мешают блики.

source: Q: QR is not displayed in the widget. What to do?
ru: В: QR в виджете не отображается. Что делать?

source: A: Try to re-scan your QR or remove and re-add the widget.
ru: О: Попробуйте повторно отсканировать ваш QR или удалить и снова добавить виджет.

source: Q: QR in the widget cannot be scanned. What to do?
ru: В: QR в виджете не получается отсканировать. Что делать?

source: A: Try to increase the brightness of your screen, perhaps the current brightness is not enough and the scanning device cannot detect QR.
ru: О: Попробуйте повысить яркость своего экрана, возможно текущей яркости не хватает и сканирующее устройство не может определить QR.

source: How it works?
ru: Как работает?

source: Permission error
ru: Доступ запрещен

source: Permission error occured. Please open Settings - Privacy - Camera and check QrWidget permission.
ru: Доступ к камере запрещен. Пожалуйста откройте Настройки - Конфиденциальность - Камера и разрешите доступ к камере приложению QrWidget.

source: Permission error occured. Please open Settings - Privacy - Photo and check QrWidget permission.
ru: Доступ к галерее запрещен. Пожалуйста откройте Настройки - Конфиденциальность - Фото и разрешите доступ к галерее приложению QrWidget.

source: Unknown error
ru: Неизвестная ошибка

source: Unknown error occured. Please try restart / reinstall the app. If nothing helps - contact me at undestroyer@gmail.com
ru: Произошла неизвестная ошибка. Попробуйте перезапустить / переустановить приложение. Если ошибка повторится - напишите мне на undestroyer@gmail.com

source: Open Mail app
ru: Открыть приложение почты

source: Configuration
ru: Конфигурация

source: Opens app for scanning new QR
ru: Открывает приложение для сканирования нового QR

source: Pick from a gallery
ru: Выбрать из галереи

source: Type QR content manually
ru: Ввести текст QR вручную

source: QR not found
ru: QR не найден

source: QR was not found on a picked photo. Please pick another photo or use scanner.
ru: Не удалось обнаружить QR на выбранной фотографии. Пожалуйста выберите другое фото или используйте сканер.

source: Type QR content
ru: Введите текст QR

source: Cancel
ru: Отмена
